/*verblist = [
    ["ἄγω"],
    ["γράφω"],
    ["διώκω"],
    ["ἔχω"],
    ["θύω"],
    ["κωλύω"],
    ["λύω"],
    ["πέμπω"],
    ["φέρω"],
    ["φεύγω"],
    ["φυλάττω"],
    ["θεραπεύω"],
    ["παύω"],
    ["πείθω"],
    ["στρατεύω"],
    ["βασιλεύω"],
    ["παιδεύω"],
    ["πιστεύω"],
    ["κινδυνεύω"],
    ["μένω"],
    ["βλάπτω"],
    ["ἐθέλω"],
    ["κελεύω"],
    ["κόπτω"],
    ["παρέχω"]
]*/

verblist = [
	["λύω", "λύσω", "ἔλυσα", "λέλυκα", "λέλυμαι", "ἐλύθην"],
	["ἄγω", "ἄξω", "ἤγαγον", "ἦχα", "ἦγμαι", "ἤχθην"]
//	["", "", "", "", "", ""],
]

function getVerb(verb) {
	for (i=0; i<verblist.length; i++) {
		if (verblist[i][0] == verb) {
			return verblist[i]
		}
	}
	return false
}
