/*verblist = [
    ["ἄγω"],
    ["γράφω"],
    ["διώκω"],
    ["ἔχω"],
    ["θύω"],
    ["κωλύω"],
    ["λύω"],
    ["πέμπω"],
    ["φέρω"],
    ["φεύγω"],
    ["φυλάττω"],
    ["θεραπεύω"],
    ["παύω"],
    ["πείθω"],
    ["στρατεύω"],
    ["βασιλεύω"],
    ["παιδεύω"],
    ["πιστεύω"],
    ["κινδυνεύω"],
    ["μένω"],
    ["βλάπτω"],
    ["ἐθέλω"],
    ["κελεύω"],
    ["κόπτω"],
    ["παρέχω"]
]*/

verblist = [
	["ἄγω", "ἄξω", "ἤγαγον", "ἦχα", "ἦγμαι", "ἤχθην"],
	["ἀναγκάζω", "ἀναγκάσω", "ἠνάγκασα", "ἠνάγκακα", "ἠνάγκασμαι", "ἠναγκάσθην"],
	["βασιλεύω", "βασιλεύσω", "ἐβασίλευσα", "-", "-", "-"],
	["βλάπτω", "βλάψω", "ἔβλαψα", "βέβλαφα", "βέβλαμμαι", "ἐβλάβην"],
	["γράφω", "γράψω", "ἔγραψα", "γέγραφα", "γέγραμμαι", "ἐγράφην"],
	["διώκω", "διώξω", "ἐδίωξα", "δεδίωχα", "-", "-"],
	["ἐθέλω", "ἐθελήσω", "ἠθέλησα", "ἠθέληκα", "-", "-"],
	["εὑρίσκω", "εὑρήσω", "ηὗρον", "ηὕρηκα", "ηὕρημαι", "ηὑρέθην"],
	["θεραπεύω", "θεραπεύσω", "ἐθεράπευσα", "τεθεράπευκα", "τεθεράπευμαι", "ἐθεραπεύθην"],
	["θύω", "θύσω", "ἔθυσα", "τέθυκα", "τέθυμαι", "ἐτύθην"],
	["κελεύω", "κελεύσω", "ἐκέλευσα", "κεκέλευκα", "κεκέλευμαι", "ἐκελεύθην"],
	["κινδυνεύω", "κινδυνεύσω", "ἐκινδύνευσα", "κεκινδύνευκα", "κεκινδύνευμαι", "ἐκινδυνεύθην"],
	["κωλύω", "κωλύσω", "ἐκώλυσα", "κεκώλυκα", "κεκώλυμαι", "ἐκωλύθην"],
	["λέγω", "λέξω", "ἔλεξα", "εἴρηκα", "λέλεγμαι", "ἐλέχθην"],
	["λείπω", "λείψω", "ἔλιπον", "λέλοιπα", "λέλειμμαι", "ἐλείφθην"],
	["λύω", "λύσω", "ἔλυσα", "λέλυκα", "λέλυμαι", "ἐλύθην"],
	["μέλλω", "μελλήσω", "ἐμέλλησα", "-", "-", "-"],
	["παιδεύω", "παιδεύσω", "ἐπαίδευσα", "πεπαίδευκα", "πεπαίδευμαι", "ἐπαιδεύθην"],
	["παύω", "παύσω", "ἔπαυσα", "πέπαυκα", "πέπαυμαι", "ἐπαύθην"],
	["πέμπω", "πέπψω", "ἔπεμψα", "πέπομφα", "πέπεμμαι", "ἐπέμφθην"],
	["πιστεύω", "πιστεύσω", "ἐπίστευσα", "πεπίστευκα", "πεπίστευμαι", "ἐπιστεύθην"],
	["στρατεύω", "στρατεύσω", "ἐστράτευσα", "ἐστράτευκα", "ἐστράτευμαι", "-"],
	["σῴζω", "σώσω", "ἔσωσα", "σέσωκα", "σέσω(σ)μαι", "ἐσώθην"], // ---------------------------------------------------------------------
	["τάττω", "τάξω", "ἔταξα", "τέταχα", "τέταγμαι", "ἐτάχθην"],
	["φέρω", "οἴσω", "ἤνεγκον", "ἐνήνοχα", "ἐνήνεγμαι", "ἠνέχθην"],
	["φυλάττω", "φυλάξω", "ἐφύλαξα", "πεφύλαχα", "πεφύλαγμαι", "ἐφυλάχθην"]
//	["", "", "", "", "", ""],
]

function getVerb(verb) {
	for (i=0; i<verblist.length; i++) {
		if (verblist[i][0] == verb) {
			return verblist[i]
		}
	}
	return false
}
